Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU202.h
#define _IFS3_DCIEIF_POSITION                    0x0000000B
#define _IFS3_DCIEIF_MASK                        0x00000800
#define _IFS3_DCIEIF_LENGTH                      0x00000001

#define _IFS3_DCIIF_POSITION                     0x0000000C
#define _IFS3_DCIIF_MASK                         0x00001000
#define _IFS3_DCIIF_LENGTH                       0x00000001

#define _IFS4_U1EIF_POSITION                     0x00000001
#define _IFS4_U1EIF_MASK                         0x00000002
#define _IFS4_U1EIF_LENGTH                       0x00000001

#define _IFS4_U2EIF_POSITION                     0x00000002
#define _IFS4_U2EIF_MASK                         0x00000004
#define _IFS4_U2EIF_LENGTH                       0x00000001

#define _IFS4_CRCIF_POSITION                     0x00000003
#define _IFS4_CRCIF_MASK                         0x00000008
#define _IFS4_CRCIF_LENGTH                       0x00000001

#define _IFS4_CTMUIF_POSITION                    0x0000000D
#define _IFS4_CTMUIF_MASK                        0x00002000
#define _IFS4_CTMUIF_LENGTH                      0x00000001

#define _IFS5_U3EIF_POSITION                     0x00000001
#define _IFS5_U3EIF_MASK                         0x00000002
#define _IFS5_U3EIF_LENGTH                       0x00000001

#define _IFS5_U3RXIF_POSITION                    0x00000002
#define _IFS5_U3RXIF_MASK                        0x00000004
#define _IFS5_U3RXIF_LENGTH                      0x00000001

#define _IFS5_U3TXIF_POSITION                    0x00000003
#define _IFS5_U3TXIF_MASK                        0x00000008
#define _IFS5_U3TXIF_LENGTH                      0x00000001

#define _IFS5_USB1IF_POSITION                    0x00000006
#define _IFS5_USB1IF_MASK                        0x00000040
#define _IFS5_USB1IF_LENGTH                      0x00000001

#define _IFS5_U4EIF_POSITION                     0x00000007
#define _IFS5_U4EIF_MASK                         0x00000080
#define _IFS5_U4EIF_LENGTH                       0x00000001

#define _IFS5_U4RXIF_POSITION                    0x00000008
#define _IFS5_U4RXIF_MASK                        0x00000100
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x00000009
#define _IFS5_U4TXIF_MASK                        0x00000200
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_SPI3EIF_POSITION                   0x0000000A
#define _IFS5_SPI3EIF_MASK                       0x00000400
#define _IFS5_SPI3EIF_LENGTH                     0x00000001

#define _IFS5_SPI3IF_POSITION                    0x0000000B
#define _IFS5_SPI3IF_MASK                        0x00000800
#define _IFS5_SPI3IF_LENGTH                      0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000E
#define _IFS5_PWM1IF_MASK                        0x00004000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000F
#define _IFS5_PWM2IF_MASK                        0x00008000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS6_PWM3IF_POSITION                    0x00000000
#define _IFS6_PWM3IF_MASK                        0x00000001
#define _IFS6_PWM3IF_LENGTH                      0x00000001

#define _IFS8_ICDIF_POSITION                     0x0000000E
#define _IFS8_ICDIF_MASK                         0x00004000
#define _IFS8_ICDIF_LENGTH                       0x00000001

#define _IFS8_JTAGIF_POSITION                    0x0000000F
#define _IFS8_JTAGIF_MASK                        0x00008000
#define _IFS8_JTAGIF_LENGTH                      0x00000001

#define _IFS9_PTGSTEPIF_POSITION                 0x00000001
#define _IFS9_PTGSTEPIF_MASK                     0x00000002
#define _IFS9_PTGSTEPIF_LENGTH                   0x00000001

#define _IFS9_PTGWDTIF_POSITION                  0x00000002
#define _IFS9_PTGWDTIF_MASK                      0x00000004
#define _IFS9_PTGWDTIF_LENGTH                    0x00000001

#define _IFS9_PTG0IF_POSITION                    0x00000003
#define _IFS9_PTG0IF_MASK                        0x00000008
#define _IFS9_PTG0IF_LENGTH                      0x00000001

#define _IFS9_PTG1IF_POSITION                    0x00000004
#define _IFS9_PTG1IF_MASK                        0x00000010
#define _IFS9_PTG1IF_LENGTH                      0x00000001

#define _IFS9_PTG2IF_POSITION                    0x00000005
#define _IFS9_PTG2IF_MASK                        0x00000020
#define _IFS9_PTG2IF_LENGTH                      0x00000001

#define _IFS9_PTG3IF_POSITION                    0x00000006
#define _IFS9_PTG3IF_MASK                        0x00000040
#define _IFS9_PTG3IF_LENGTH                      0x00000001

#define _IFS10_DFWRIF_POSITION                   0x0000000A
#define _IFS10_DFWRIF_MASK                       0x00000400
#define _IFS10_DFWRIF_LENGTH                     0x00000001

#define _IFS10_DFRDIF_POSITION                   0x0000000B
#define _IFS10_DFRDIF_MASK                       0x00000800
#define _IFS10_DFRDIF_LENGTH                     0x00000001

#define _IFS10_DFERRIF_POSITION                  0x0000000C
#define _IFS10_DFERRIF_MASK                      0x00001000
#define _IFS10_DFERRIF_LENGTH                    0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_DMA0IE_POSITION                    0x00000004
#define _IEC0_DMA0IE_MASK                        0x00000010
#define _IEC0_DMA0IE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000005
#define _IEC0_IC2IE_MASK                         0x00000020
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000006
#define _IEC0_OC2IE_MASK                         0x00000040
#define _IEC0_OC2IE_LENGTH                       0x00000001

