Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU202.h
#define _IPC37_PTG3IP2_POSITION                  0x0000000A
#define _IPC37_PTG3IP2_MASK                      0x00000400
#define _IPC37_PTG3IP2_LENGTH                    0x00000001

#define _IPC42_DFWRIP_POSITION                   0x00000008
#define _IPC42_DFWRIP_MASK                       0x00000700
#define _IPC42_DFWRIP_LENGTH                     0x00000003

#define _IPC42_DFRDIP_POSITION                   0x0000000C
#define _IPC42_DFRDIP_MASK                       0x00007000
#define _IPC42_DFRDIP_LENGTH                     0x00000003

#define _IPC42_DFWRIP0_POSITION                  0x00000008
#define _IPC42_DFWRIP0_MASK                      0x00000100
#define _IPC42_DFWRIP0_LENGTH                    0x00000001

#define _IPC42_DFWRIP1_POSITION                  0x00000009
#define _IPC42_DFWRIP1_MASK                      0x00000200
#define _IPC42_DFWRIP1_LENGTH                    0x00000001

#define _IPC42_DFWRIP2_POSITION                  0x0000000A
#define _IPC42_DFWRIP2_MASK                      0x00000400
#define _IPC42_DFWRIP2_LENGTH                    0x00000001

#define _IPC42_DFRDIP0_POSITION                  0x0000000C
#define _IPC42_DFRDIP0_MASK                      0x00001000
#define _IPC42_DFRDIP0_LENGTH                    0x00000001

#define _IPC42_DFRDIP1_POSITION                  0x0000000D
#define _IPC42_DFRDIP1_MASK                      0x00002000
#define _IPC42_DFRDIP1_LENGTH                    0x00000001

#define _IPC42_DFRDIP2_POSITION                  0x0000000E
#define _IPC42_DFRDIP2_MASK                      0x00004000
#define _IPC42_DFRDIP2_LENGTH                    0x00000001

#define _IPC43_DFERRIP_POSITION                  0x00000000
#define _IPC43_DFERRIP_MASK                      0x00000007
#define _IPC43_DFERRIP_LENGTH                    0x00000003

#define _IPC43_DFERRIP0_POSITION                 0x00000000
#define _IPC43_DFERRIP0_MASK                     0x00000001
#define _IPC43_DFERRIP0_LENGTH                   0x00000001

#define _IPC43_DFERRIP1_POSITION                 0x00000001
#define _IPC43_DFERRIP1_MASK                     0x00000002
#define _IPC43_DFERRIP1_LENGTH                   0x00000001

#define _IPC43_DFERRIP2_POSITION                 0x00000002
#define _IPC43_DFERRIP2_MASK                     0x00000004
#define _IPC43_DFERRIP2_LENGTH                   0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_DMACERR_POSITION                0x00000005
#define _INTCON1_DMACERR_MASK                    0x00000020
#define _INTCON1_DMACERR_LENGTH                  0x00000001

#define _INTCON1_DIV0ERR_POSITION                0x00000006
#define _INTCON1_DIV0ERR_MASK                    0x00000040
#define _INTCON1_DIV0ERR_LENGTH                  0x00000001

#define _INTCON1_SFTACERR_POSITION               0x00000007
#define _INTCON1_SFTACERR_MASK                   0x00000080
#define _INTCON1_SFTACERR_LENGTH                 0x00000001

#define _INTCON1_COVTE_POSITION                  0x00000008
#define _INTCON1_COVTE_MASK                      0x00000100
#define _INTCON1_COVTE_LENGTH                    0x00000001

#define _INTCON1_OVBTE_POSITION                  0x00000009
#define _INTCON1_OVBTE_MASK                      0x00000200
#define _INTCON1_OVBTE_LENGTH                    0x00000001

#define _INTCON1_OVATE_POSITION                  0x0000000A
#define _INTCON1_OVATE_MASK                      0x00000400
#define _INTCON1_OVATE_LENGTH                    0x00000001

#define _INTCON1_COVBERR_POSITION                0x0000000B
#define _INTCON1_COVBERR_MASK                    0x00000800
#define _INTCON1_COVBERR_LENGTH                  0x00000001

#define _INTCON1_COVAERR_POSITION                0x0000000C
#define _INTCON1_COVAERR_MASK                    0x00001000
#define _INTCON1_COVAERR_LENGTH                  0x00000001

#define _INTCON1_OVBERR_POSITION                 0x0000000D
#define _INTCON1_OVBERR_MASK                     0x00002000
#define _INTCON1_OVBERR_LENGTH                   0x00000001

#define _INTCON1_OVAERR_POSITION                 0x0000000E
#define _INTCON1_OVAERR_MASK                     0x00004000
#define _INTCON1_OVAERR_LENGTH                   0x00000001

#define _INTCON1_NSTDIS_POSITION                 0x0000000F
#define _INTCON1_NSTDIS_MASK                     0x00008000
#define _INTCON1_NSTDIS_LENGTH                   0x00000001

#define _INTCON2_INT0EP_POSITION                 0x00000000
#define _INTCON2_INT0EP_MASK                     0x00000001
#define _INTCON2_INT0EP_LENGTH                   0x00000001

#define _INTCON2_INT1EP_POSITION                 0x00000001
#define _INTCON2_INT1EP_MASK                     0x00000002
#define _INTCON2_INT1EP_LENGTH                   0x00000001

#define _INTCON2_INT2EP_POSITION                 0x00000002
#define _INTCON2_INT2EP_MASK                     0x00000004
#define _INTCON2_INT2EP_LENGTH                   0x00000001

#define _INTCON2_INT3EP_POSITION                 0x00000003
#define _INTCON2_INT3EP_MASK                     0x00000008
#define _INTCON2_INT3EP_LENGTH                   0x00000001

#define _INTCON2_INT4EP_POSITION                 0x00000004
#define _INTCON2_INT4EP_MASK                     0x00000010
#define _INTCON2_INT4EP_LENGTH                   0x00000001

#define _INTCON2_SWTRAP_POSITION                 0x0000000D
#define _INTCON2_SWTRAP_MASK                     0x00002000
#define _INTCON2_SWTRAP_LENGTH                   0x00000001

#define _INTCON2_DISI_POSITION                   0x0000000E
#define _INTCON2_DISI_MASK                       0x00004000
#define _INTCON2_DISI_LENGTH                     0x00000001

#define _INTCON2_GIE_POSITION                    0x0000000F
#define _INTCON2_GIE_MASK                        0x00008000
#define _INTCON2_GIE_LENGTH                      0x00000001

#define _INTCON3_USBPLL_POSITION                 0x00000002
#define _INTCON3_USBPLL_MASK                     0x00000004
#define _INTCON3_USBPLL_LENGTH                   0x00000001

#define _INTCON3_DOOVR_POSITION                  0x00000004
#define _INTCON3_DOOVR_MASK                      0x00000010
#define _INTCON3_DOOVR_LENGTH                    0x00000001

#define _INTCON3_DAE_POSITION                    0x00000005
#define _INTCON3_DAE_MASK                        0x00000020
#define _INTCON3_DAE_LENGTH                      0x00000001

#define _INTCON3_UAE_POSITION                    0x00000006
#define _INTCON3_UAE_MASK                        0x00000040
#define _INTCON3_UAE_LENGTH                      0x00000001

#define _INTCON3_NAE_POSITION                    0x00000008
#define _INTCON3_NAE_MASK                        0x00000100
#define _INTCON3_NAE_LENGTH                      0x00000001

#define _INTCON4_SGHT_POSITION                   0x00000000
#define _INTCON4_SGHT_MASK                       0x00000001
#define _INTCON4_SGHT_LENGTH                     0x00000001

#define _INTTREG_VECNUM_POSITION                 0x00000000
#define _INTTREG_VECNUM_MASK                     0x000000FF
#define _INTTREG_VECNUM_LENGTH                   0x00000008

#define _INTTREG_ILR_POSITION                    0x00000008
#define _INTTREG_ILR_MASK                        0x00000F00
#define _INTTREG_ILR_LENGTH                      0x00000004

#define _INTTREG_VECNUM0_POSITION                0x00000000
#define _INTTREG_VECNUM0_MASK                    0x00000001
#define _INTTREG_VECNUM0_LENGTH                  0x00000001

#define _INTTREG_VECNUM1_POSITION                0x00000001
#define _INTTREG_VECNUM1_MASK                    0x00000002
#define _INTTREG_VECNUM1_LENGTH                  0x00000001

#define _INTTREG_VECNUM2_POSITION                0x00000002
#define _INTTREG_VECNUM2_MASK                    0x00000004
#define _INTTREG_VECNUM2_LENGTH                  0x00000001

#define _INTTREG_VECNUM3_POSITION                0x00000003
#define _INTTREG_VECNUM3_MASK                    0x00000008
#define _INTTREG_VECNUM3_LENGTH                  0x00000001

